src/InformationRegisters/СообщенияКонтурСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СообщенияКонтурСтрахование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>documentDate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>checkingStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationCompletionTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationStartTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastEventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>messageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reasons</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipientMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>senderMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>totalWorkTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеКС</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>mediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventDateTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыПолиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПолиса</Name>
			<Comment>Типы полисов клиентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеМедицинскоеСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеМедицинскоеСтрахование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АктОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АктОказанияУслуг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленВКонтурСтрахование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОказанныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СообщенияКонтурСтрахование/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВнешняяСистемаКС = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.КонтурСтрахование, Истина);
	ПараметрыВС = ВнешняяСистемаКС.Параметры.Получить();
	
	Демо = ПараметрыВС.Демо;
	
	token = ВнешняяСистемаКС.ТокенДоступа;
	Для Каждого ЭлементМ Из ПараметрыВС.МассивОрганизаций Цикл
		Элементы.Организация.СписокВыбора.Добавить(ЭлементМ.mediId);	
	КонецЦикла;
	
	lastEventPointer = РегистрыСведений.СообщенияКонтурСтрахование.ПоследнееПисьмо();
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "documentType", "Relist", Истина, ВидСравненияКомпоновкиДанных.Равно);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "checkingStatus", "Ok", Истина, ВидСравненияКомпоновкиДанных.Равно);
	СписокОтбор = "Relist";
	СтатусыСообщений = "Ok";  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды ПолучитьСписокСобытий
//
Процедура ПолучитьСписокСобытий(Команда) 
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначения.СообщитьПользователю("Выберите нужную организацию"); 
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьСобытия(Организация, lastEventPointer, 100);
	ПолучитьСписокСобытийНаСервере(Результат);
	
	lastEventPointer = Результат.Получить("lastEventPointer"); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьСобытия(mediId, lastEventPointer = "", Количество = 100) Экспорт
	
	Запрос = Новый HTTPЗапрос();
	Запрос.АдресРесурса = "/V2/events";
	Запрос.Заголовки.Вставить("Authorization", "Bearer "+token);
	
	URL_УстановитьПараметр(Запрос.АдресРесурса, "mediId", mediId);
	URL_УстановитьПараметр(Запрос.АдресРесурса, "count", Количество);
	Если ЗначениеЗаполнено(lastEventPointer) Тогда
		URL_УстановитьПараметр(Запрос.АдресРесурса, "lastEventPointer", lastEventPointer);
	КонецЕсли;
	
	Ответ = Клиент_get(Запрос,ХостАпи());
	
	Если Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение "Запрос не авторизован: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 400 Тогда
		ВызватьИсключение "Некорректный запрос: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение "Не удалось выполнить запрос: " + Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат JSON_Прочитать(Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции  

&НаСервереБезКонтекста
Функция URL_Кодировать(Параметр) Экспорт
	
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		
		Возврат КодироватьСтроку(Параметр, СпособКодированияСтроки.КодировкаURL);	
		
	ИначеЕсли ТипЗнч(Параметр) = Тип("Структура")
		ИЛИ ТипЗнч(Параметр) = Тип("Соответствие") Тогда
		
		МассивПараметров = Новый Массив;	
		
		Для Каждого Элемент Из Параметр Цикл
			
			Если Элемент.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Параметр = СтрШаблон("%1=%2", Элемент.Ключ, XMLСтрока(Элемент.Значение));
			МассивПараметров.Добавить(Параметр);
			
		КонецЦикла;
		
		Строка = СтрСоединить(МассивПараметров, "&");
		
		Возврат КодироватьСтроку(Строка, СпособКодированияСтроки.URLВКодировкеURL);
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура URL_УстановитьПараметр(АдресРесурса, Ключ, Значение) Экспорт
	
	Если СтрНайти(АдресРесурса, СтрШаблон("{%1}", Ключ)) <> 0 Тогда
		URL_УстановитьПараметрПуть(АдресРесурса, Ключ, Значение);
	Иначе
		URL_УстановитьПараметрЗапрос(АдресРесурса, Ключ, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура URL_УстановитьПараметрПуть(АдресРесурса, Ключ, Значение) Экспорт
	
	ЧастиАдреса = СтрРазделить(АдресРесурса, "?", Истина);
	Если ЧастиАдреса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиАдреса[0] = СтрЗаменить(
	ЧастиАдреса[0], 
	СтрШаблон("{%1}", Ключ), 
	URL_Кодировать(Значение));
	
	АдресРесурса = СтрСоединить(ЧастиАдреса, "?");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура URL_УстановитьПараметрЗапрос(АдресРесурса, Ключ, Значение) Экспорт
	
	ЧастиАдреса = СтрРазделить(АдресРесурса, "?", Истина);
	
	Если ЧастиАдреса.Количество() = 0 Тогда
		Возврат;
	ИначЕесли ЧастиАдреса.Количество() = 1 Тогда
		ЧастиАдреса.Добавить();
	ИначеЕсли ЧастиАдреса.Количество() > 2 Тогда
		ВызватьИсключение "Не предполагаемый формат URL";
	КонецЕсли;
	
	ПараметрыАдреса	= СтрРазделить(ЧастиАдреса[1], "&", Ложь);
	ПараметрыИндекс = Неопределено;
	
	Сч = -1;
	
	Для Каждого Элемент Из ПараметрыАдреса Цикл
		
		Сч = Сч + 1;
		
		Параметр = СтрРазделить(Элемент, "=", Истина);
		Если Параметр.Количество() <> 2 Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Параметр[0] = Ключ Тогда
			ПараметрыИндекс = Сч;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;		
	
	Параметр = СтрШаблон("%1=%2", Ключ, XMLСтрока(Значение));
	
	Если ПараметрыИндекс = Неопределено Тогда
		ПараметрыАдреса.Добавить(Параметр);
	Иначе
		ПараметрыАдреса[ПараметрыИндекс] = Параметр;
	КонецЕсли;
	
	ЧастиАдреса[1] 		 = СтрСоединить(ПараметрыАдреса, "&");
	АдресРесурса = СтрСоединить(ЧастиАдреса, "?");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция JSON_Прочитать(Значение) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция Клиент_GET(Запрос, Хост) Экспорт
	
	Возврат ВыполнитьHTTPМетод("GET", Запрос, Хост);
	
КонецФункции

&НаКлиенте
Функция ХостАпи()
	
	Возврат ?(Демо, "medi-api.testkontur.ru", "medi-api.kontur.ru");
	
КонецФункции

&НаКлиенте
Функция ВыполнитьHTTPМетод(Метод, Запрос, Хост)
	
	Возврат Соединение(Хост).ВызватьHTTPМетод(Метод, Запрос);
	
КонецФункции

&НаКлиенте
Функция Соединение(Хост)
	
	Порт = 443;
	
	Соединение = Новый HTTPСоединение(Хост, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Возврат Соединение;
	
КонецФункции

&НаСервере
Процедура ПолучитьСписокСобытийНаСервере(Результат)
	
	РегистрыСведений.СообщенияКонтурСтрахование.ПолучитьСписокСобытийНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Функция GetMessage(messageId) Экспорт
	
	Запрос = Новый HTTPЗапрос("/V2/messages/{messageId}");
	Запрос.Заголовки.Вставить("Authorization", "Bearer "+ token);
	
	URL_УстановитьПараметр(Запрос.АдресРесурса, "messageId", messageId);
	
	Ответ = Клиент_get(Запрос,ХостАпи());
	
	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение "Сообщение не найдено: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение "Запрос не авторизован: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 400 Тогда
		ВызватьИсключение "Некорректный формат идентификатора сообщения: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение "Не удалось выполнить запрос: " + Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат JSON_Прочитать(Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

&НаКлиенте
Процедура СписокОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "documentType", СписокОтбор, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекСтрока.documentType = "Ihclme" Тогда
		ДатаДокумента = Дата(ТекСтрока.documentDate);
		СтандартнаяОбработка = Ложь;
		АктОказанныхУслуг = ПолучитьСсылкуНаАкт(ТекСтрока.documentNumber, ДатаДокумента); 
		ОткрытьФорму("Документ.АктОказанияУслуг.Форма.ФормаДокумента", Новый Структура("Ключ", АктОказанныхУслуг), , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаАкт(НомерДокумента, ДатаДокумента)
	
	Возврат Документы.АктОказанияУслуг.НайтиПоНомеру(НомерДокумента, ДатаДокумента);
	
КонецФункции  

&НаСервере
Процедура ОтработатьПисьмоНаСервере()
	
	РегистрыСведений.СообщенияКонтурСтрахование.ОбработатьСообщенияКонтурСтрахование();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьПисьмо(Команда)   
	
	ОтработатьПисьмоНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьHTTPМетодСервер(Метод, Запрос, Хост)
	
	Возврат СоединениеСервер(Хост).ВызватьHTTPМетод(Метод, Запрос);
	
КонецФункции

&НаСервере
Функция СоединениеСервер(Хост)
	
	Порт = 443;
	
	Соединение = Новый HTTPСоединение(Хост, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Возврат Соединение;
	
КонецФункции

&НаСервере
Процедура ЗаписатьДанныеПолисов(Сообщение);
	
	ТаблицаЗастрахованных = Новый ТаблицаЗначений;
	ТаблицаЗастрахованных.Колонки.Добавить("Фамилия");
	ТаблицаЗастрахованных.Колонки.Добавить("Имя");
	ТаблицаЗастрахованных.Колонки.Добавить("Отчество");
	ТаблицаЗастрахованных.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
	ТаблицаЗастрахованных.Колонки.Добавить("Пол", Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
	ТаблицаЗастрахованных.Колонки.Добавить("НомерПолиса"); 
	ТаблицаЗастрахованных.Колонки.Добавить("ДействуетС", Новый ОписаниеТипов("Дата"));
	ТаблицаЗастрахованных.Колонки.Добавить("ДействуетПо", Новый ОписаниеТипов("Дата"));
	ТаблицаЗастрахованных.Колонки.Добавить("Страхователь");
	ТаблицаЗастрахованных.Колонки.Добавить("ПрограммаПрикрепления");
	
	Если ТипЗнч(Сообщение) = Тип("Соответствие") Тогда
		
		ДвоичныеДанные = Base64Значение(Сообщение.Получить("data").Получить("content"));
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		Для Каждого Глубина1 Из ДокументDOM.ЭлементДокумента.ДочерниеУзлы Цикл
			
			Если Глубина1.ИмяУзла = "interchangeHeader" Тогда
				Для Каждого Глубина2 Из Глубина1.ДочерниеУзлы Цикл
					Если Глубина2.ИмяУзла = "sender" Тогда
						Отправитель = Глубина2.ТекстовоеСодержимое;
					ИначеЕсли Глубина2.ИмяУзла = "recipient" Тогда
						Получатель = Глубина2.ТекстовоеСодержимое;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Глубина1.ИмяУзла = "insurantsList" Тогда
				
				Для Каждого Глубина2 Из Глубина1.Атрибуты Цикл
					Если Глубина2.ИмяУзла = "insurantsListNumber" Тогда     
						НомерСписка = Глубина2.ЗначениеУзла;
					ИначеЕсли Глубина2.ИмяУзла = "insurantsListDate" Тогда 
						Если СтрНайти(Глубина2.ЗначениеУзла, "-") > 0 Тогда
							ДатаСписка = Дата(СтрЗаменить(Глубина2.ЗначениеУзла, "-", ""));
						Иначе
							ДатаСписка = Дата('00010101');
							ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(ДатаСписка, Глубина2.ЗначениеУзла);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;   
				
				Для Каждого Глубина2 Из Глубина1.ДочерниеУзлы Цикл
					
					Если Глубина2.ИмяУзла = "contractIdentificator" Тогда
						Для Каждого Глубина3 Из Глубина2.Атрибуты Цикл
							Если Глубина3.ИмяУзла = "number" Тогда     
								НомерДоговора = Глубина3.ЗначениеУзла;
							ИначеЕсли Глубина3.ИмяУзла = "date" Тогда 
								Если СтрНайти(Глубина3.ЗначениеУзла, "-") > 0 Тогда
									ДатаДоговора = Дата(СтрЗаменить(Глубина3.ЗначениеУзла, "-", ""));
								Иначе
									ДатаДоговора = Дата('00010101');
									ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(ДатаДоговора, Глубина3.ЗначениеУзла);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если Глубина2.ИмяУзла = "insuranceCompany" Тогда     
						Для Каждого Глубина3 Из Глубина2.ДочерниеУзлы Цикл
							Если Глубина3.ИмяУзла = "mediId" Тогда	
								mediId = Глубина3.ТекстовоеСодержимое;                 
							ИначеЕсли Глубина3.ИмяУзла = "organization" Тогда
								Для Каждого Глубина4 Из Глубина3.ДочерниеУзлы Цикл
									Если Глубина4.ИмяУзла = "name" Тогда     
										НаименованиеСК = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "inn" Тогда 
										ИНН = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "kpp" Тогда 
										КПП = Глубина4.ТекстовоеСодержимое;
									КонецЕсли;	
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					ИначеЕсли Глубина2.ИмяУзла = "healthCareProvider" Тогда 
						Для Каждого Глубина3 Из Глубина2.ДочерниеУзлы Цикл
							Если Глубина3.ИмяУзла = "mediId" Тогда	
								mediIdОрганизации = Глубина3.ТекстовоеСодержимое;                 
							ИначеЕсли Глубина3.ИмяУзла = "organization" Тогда
								Для Каждого Глубина4 Из Глубина3.ДочерниеУзлы Цикл
									Если Глубина4.ИмяУзла = "name" Тогда     
										НаименованиеОрганизации = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "inn" Тогда 
										ИННОрганизации = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "kpp" Тогда 
										КППОрганизации = Глубина4.ТекстовоеСодержимое;
									КонецЕсли;	
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					ИначеЕсли Глубина2.ИмяУзла = "listOfInsurants" Тогда
						//Элементы.ГруппаВходящее.Видимость = Истина;
						Для Каждого Глубина3 Из Глубина2.ДочерниеУзлы Цикл	
							Если Глубина3.ИмяУзла = "insurant" Тогда 
								НоваяСтрока = ТаблицаЗастрахованных.Добавить();
								Для Каждого Глубина4 Из Глубина3.ДочерниеУзлы Цикл
									Если Глубина4.ИмяУзла = "fullName" Тогда
										Для Каждого Глубина5 Из Глубина4.ДочерниеУзлы Цикл
											Если Глубина5.ИмяУзла = "lastName" Тогда
												НоваяСтрока.Фамилия = ТРег(Глубина5.ТекстовоеСодержимое);	
											ИначеЕсли Глубина5.ИмяУзла = "firstName" Тогда
												НоваяСтрока.Имя = ТРег(Глубина5.ТекстовоеСодержимое);		
											ИначеЕсли Глубина5.ИмяУзла = "middleName" Тогда
												НоваяСтрока.Отчество = ТРег(Глубина5.ТекстовоеСодержимое);	
											КонецЕсли;
										КонецЦикла;
									ИначеЕсли Глубина4.ИмяУзла = "dateOfBirth" Тогда
										НоваяСтрока.ДатаРождения = Дата(СтрЗаменить(Глубина4.ТекстовоеСодержимое, "-", ""));				
									ИначеЕсли Глубина4.ИмяУзла = "gender" Тогда     
										Если Глубина4.ТекстовоеСодержимое = "Female" Тогда
											НоваяСтрока.Пол = Перечисления.ПолФизическогоЛица.Женский;	
										ИначеЕсли Глубина4.ТекстовоеСодержимое = "Male" Тогда
											НоваяСтрока.Пол = Перечисления.ПолФизическогоЛица.Мужской;	
										КонецЕсли;
									ИначеЕсли Глубина4.ИмяУзла = "insurancePolicy" Тогда
										Для Каждого Глубина5 Из Глубина4.ДочерниеУзлы Цикл
											Если Глубина5.ИмяУзла = "number" Тогда
												НоваяСтрока.НомерПолиса = Глубина5.ТекстовоеСодержимое;	
											ИначеЕсли Глубина5.ИмяУзла = "fromDate" Тогда
												НоваяСтрока.ДействуетС = Дата(СтрЗаменить(Глубина5.ТекстовоеСодержимое, "-", ""));
											ИначеЕсли Глубина5.ИмяУзла = "toDate" Тогда
												НоваяСтрока.ДействуетПО = Дата(СтрЗаменить(Глубина5.ТекстовоеСодержимое, "-", ""));
											КонецЕсли;	
										КонецЦикла;
									ИначеЕсли Глубина4.ИмяУзла = "employer" Тогда
										НоваяСтрока.Страхователь = Глубина4.ТекстовоеСодержимое;	
									ИначеЕсли Глубина4.ИмяУзла = "insuranceProgram" Тогда
										НоваяСтрока.ПрограммаПрикрепления = Глубина4.ТекстовоеСодержимое;	
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;   
			КонецЕсли;
			
			Если Глубина1.ИмяУзла = "healthCareClaim" Тогда 
				Элементы.ГруппаИсходящие.Видимость = Истина;
				Для Каждого Глубина2 Из Глубина1.Атрибуты Цикл
					Если Глубина2.ИмяУзла = "healthCareClaimNumber" Тогда
						АктОказанияУслуг = Документы.АктОказанияУслуг.НайтиПоНомеру(Глубина2.ЗначениеУзла);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Страховаякомпания = ПолучитьстраховуюКомпанию(ИНН, КПП);
		
		Если Не ЗначениеЗаполнено(Страховаякомпания) Тогда
			
			ГруппаСК = Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.СтраховаяКомпания);
			Если Не ЗначениеЗаполнено(ГруппаСК) Тогда
				ГруппаСК                 = Справочники.Контрагенты.СоздатьГруппу();
				ГруппаСК.Наименование    = "Страховые компании";
				ГруппаСК.ТипКонтрагента  = Перечисления.ТипыКонтрагентов.СтраховаяКомпания;
				ГруппаСК.Записать();
			КонецЕсли;
			
			Страховаякомпания = Справочники.Контрагенты.СоздатьЭлемент();		
			
			Страховаякомпания.Наименование          = НаименованиеСК;
			Страховаякомпания.Родитель			 	= ГруппаСК;
			Страховаякомпания.ДатаРегистрации		= ТекущаяДатаСеанса();
			Страховаякомпания.СтруктурнаяЕдиница	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
			Страховаякомпания.ЮрФизЛицо			 	= Перечисления.ЮрФизЛицо.ЮрЛицо;
			Страховаякомпания.СотрудникРегистрации  = ПараметрыСеанса.АвторизованныйПользователь;
			Страховаякомпания.ТипКонтрагента		= Перечисления.ТипыКонтрагентов.СтраховаяКомпания;
			Попытка
				Страховаякомпания.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		ДоговорСоСтраховой = ПолучитьДоговорСоСтраховой(Страховаякомпания, НомерДоговора, ДатаДоговора);
		
		Если Не ЗначениеЗаполнено(ДоговорСоСтраховой) Тогда
			
			ДоговорСоСтраховой = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			
			ДоговорСоСтраховой.Контрагент 			  = Страховаякомпания;
			ДоговорСоСтраховой.НомерДоговора 		  = НомерДоговора;
			ДоговорСоСтраховой.ДатаДоговора 		  = ДатаДоговора;
			
			
			ТекстНаименования = НСтр("ru = 'Основной Договор № %НомерДоговора% от %ДатаДоговора% c %Страховаякомпания%'");   
			ТекстНаименования = СтрЗаменить(ТекстНаименования, "%НомерДоговора%", СокрЛП(ДоговорСоСтраховой.НомерДоговора));
			ТекстНаименования = СтрЗаменить(ТекстНаименования, "%ДатаДоговора%", ?(ЗначениеЗаполнено(ДоговорСоСтраховой.ДатаДоговора), 
			СокрЛП(Строка(Формат(ДоговорСоСтраховой.ДатаДоговора, "ДФ=dd.MM.yyyy"))), ""));
			ТекстНаименования = СтрЗаменить(ТекстНаименования, "%Страховаякомпания%", СокрЛП(ДоговорСоСтраховой.Страховаякомпания));
			
			ДоговорСоСтраховой.Наименование = ТекстНаименования;
			
			Попытка
				ДоговорСоСтраховой.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли; 
		
		Для Каждого Полис Из ТаблицаЗастрахованных Цикл
			
			Пациент = ПолучитьПациента(Полис.Фамилия, Полис.Имя, Полис.Отчество, Полис.ДатаРождения);
			
			ДатаРождения = Формат(Полис.ДатаРождения, "ДФ=yyyy.MM.dd");
			Если Не ЗначениеЗаполнено(Пациент) Тогда
				Пациент = Справочники.Контрагенты.СоздатьКлиента(Полис.Фамилия, Полис.Имя, Полис.Отчество, "", "", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, ДатаРождения, Полис.Пол);   	
			КонецЕсли;
			
			ПациентОбъект = Пациент.ПолучитьОбъект();
			ПациентОбъект.СоциальныйСтатус  = Справочники.СоциальныеСтатусыКонтрагентов.Работающий; 
			ПациентОбъект.Организация 		= Полис.Страхователь;
			Попытка
				ПациентОбъект.Записать();
			Исключение
			КонецПопытки;
		
			ПолисПациента = ПолучитьПолисПациента(Пациент, Полис.НомерПолиса);
			
			Если Не ЗначениеЗаполнено(ПолисПациента) Тогда
				
				ПолисПациента = Справочники.ПолисыМедицинскогоСтрахования.СоздатьЭлемент();		
				
				ПолисПациента.Контрагент 			= Пациент;
				ПолисПациента.ТипПолиса 			= Перечисления.ТипыПолиса.ДобровольноеМедицинскоеСтрахование;
				ПолисПациента.СтраховаяКомпания 	= Страховаякомпания;
				ПолисПациента.НомерПолиса 			= Полис.НомерПолиса;
				ПолисПациента.ДанаНачала 			= Полис.ДействуетС;
				ПолисПациента.ДатаОкончания 		= Полис.ДействуетПО; 
				ПолисПациента.Договор 				= ДоговорСоСтраховой;
				ПолисПациента.Организация 			= Полис.Страхователь;
				ПолисПациента.ПрограммаПрикрепления = Полис.ПрограммаПрикрепления;
				
				Попытка
					ПолисПациента.Записать();
				Исключение
				КонецПопытки; 
				
			КонецЕсли;	

		КонецЦикла;

	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция ПолучитьстраховуюКомпанию(ИНН, КПП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП
	|	И Контрагенты.ТипКонтрагента = &ТипКонтрагента";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("ТипКонтрагента", Перечисления.ТипыКонтрагентов.СтраховаяКомпания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат	Выборка.Ссылка;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДоговорСоСтраховой(Страховаякомпания, НомерДоговора, ДатаДоговора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.НомерДоговора = &НомерДоговора
	|	И ДоговорыКонтрагентов.ДатаДоговора = &ДатаДоговора";
	
	Запрос.УстановитьПараметр("Контрагент"		, Страховаякомпания); 
	Запрос.УстановитьПараметр("НомерДоговора"	, НомерДоговора);
	Запрос.УстановитьПараметр("ДатаДоговора"	, ДатаДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат	Выборка.Ссылка;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПациента(Фамилия, Имя, Отчество, ДатаРождения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Фамилия = &Фамилия
	|	И Контрагенты.Имя = &Имя
	|	И Контрагенты.Отчество = &Отчество
	|	И Контрагенты.ДатаРожденияКлиента = &ДатаРожденияКлиента";
	
	Запрос.УстановитьПараметр("Фамилия"				, Фамилия);
	Запрос.УстановитьПараметр("Имя"					, Имя);
	Запрос.УстановитьПараметр("Отчество"			, Отчество);
	Запрос.УстановитьПараметр("ДатаРожденияКлиента"	, ДатаРождения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат	Выборка.Ссылка;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПолисПациента(Пациент, НомерПолиса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолисыМедицинскогоСтрахования.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	|ГДЕ
	|	ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
	|	И ПолисыМедицинскогоСтрахования.НомерПолиса = &НомерПолиса";
	
	Запрос.УстановитьПараметр("Контрагент"		, Пациент);
	Запрос.УстановитьПараметр("НомерПолиса"		, НомерПолиса);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат	Выборка.Ссылка;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтатусыСообщенийПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "checkingStatus", СтатусыСообщений, Истина, ВидСравненияКомпоновкиДанных.Равно);
КонецПроцедуры

#КонецОбласти
